[
    {
        "text": "Okay, I'll be the one to say it.\n\nWhat is the deal with Zoom's video call quality lately? I am constantly having to dial in using phone audio, issues are surfacing that never used to be there.\n\nThe fifth time it happened, I stopped thinking it was my fault. And now I'm getting emails from them about adding their Phone system?\n\nNo thanks.\n\nThe time to ask someone to expand their contract with you is when you're *crushing it for them, not when you're scraping $ to save on efficiency.\n\nI'm not alone, am I?",
        "line_count": 7,
        "language": "English",
        "tags": [
            "Video Conferencing",
            "Video Call Quality",
            "Customer Service"
        ]
    },
    {
        "text": "I'm excited to share that I've completed the Deep Learning with TensorFlow2 course by 365 Data Science!\n\nThis comprehensive course has deepened my understanding of deep learning fundamentals, model development, and optimization techniques. I've had the opportunity to work on practical, hands-on projects that have equipped me with the tools to build more robust models.\n\nI'm looking forward to applying the skills I've gained in future projects and continuing to push the boundaries of what I can achieve with deep learning technologies.",
        "line_count": 6,
        "language": "English",
        "tags": [
            "Data Science",
            "TensorFlow",
            "Deep Learning"
        ]
    },
    {
        "text": "THE BEAUTY OF NOT GIVING UP:\n\n-Trying out new strategies\n\n-Fixing the old ones\n\n-Realising big changes just before pressing that publish button,\n\nAnd sometimes,\n\nEven this is not enough!!\n\nBut the ultimate motto of not giving up, keeps me moving, And all of this ultimately leads to that one campaign that stunned everyone!!",
        "line_count": 10,
        "language": "English",
        "tags": [
            "Motivation",
            "Personal Growth"
        ]
    },
    {
        "text": "Don't let your imagination limit your growth!\n\nA career isn't just about financial growth; it's about becoming the best version of yourself.\n\nPersonal and professional development go hand in hand.\n\nWhen you prioritize learning, growth, and fulfillment, your career becomes much more than a paycheck.\n\nHow do you define growth?",
        "line_count": 5,
        "language": "English",
        "tags": [
            "Professional Development",
            "Career Development",
            "Personal Growth"
        ]
    },
    {
        "text": "Find a mentor who's 3-5 years ahead of you\n\n- Someone you admire.\n\nSomeone whose journey inspires you.\n\n- Someone who's done what you want to do.\n\nWe often tend to idolise people at the very top.\n\nPeople who have achieved a lot.\n\nWe want them to be our mentors.\n\nBut seek advice from those a few steps ahead of where you are.\n\nHere's why:\n\nSay you want to enter the music industry.\n\nTaylor Swift might be your idol and getting her advice might feel exciting.\n\nBut her journey now is far removed from the early struggles of starting out.\n\nInstead, ask someone who just played their first gig or signed their first record deal.\n\nWhy?\n\nBecause they've been where you are!\n\nTheir insights are more actionable and relatable.\n\nThe same applies to any career change.",
        "line_count": 19,
        "language": "English",
        "tags": [
            "Personal Growth",
            "Career Development",
            "Mentorship"
        ]
    },
    {
        "text": "أو المصطلح الدرامي: السوق المخفي\n\nالرسالة اللي ببعتها لشخص معين عاللنكد إن إنه عنا شاغر وظيفي وحابين نقابلك\n\nالترشيحات اللي ببعتها لزميل أو زميلة طلبوا مني أفضل الموجود لوظيفة معينة\n\nالإيميلات اللي بتوصل لجامعات معينة أو جهات تدريبية من الشركات بتطلب موظفين\n\nتوصيات موظفين الشركات بأسماء أصحابهم لشاغر معين\n\nهاي كلها شغلات تحت مسمى التوظيف الخفي أو السوق المخفي اللي\n\nاللي هو التوظيف بدون إعلان أو بدون ما يكون الموظف مقدم على وظيفة\n\nوهاد هو جواب سؤالك اللي بتضل تسأله :\n\nمن وين كل هالناس قاعدة بتتوظف! أنا ما شفت هاي الشركة منزل إعلان معقول البلد كلها واسطات؟\n\n90% من الوظائف اللي سكرتها آخر سنة كانت بهالطريقة\n\nوأجزم - برأيي عالأقل - إنه هاي الطريقة إلها نصيب الأسد بالسوق",
        "line_count": 12,
        "language": "Arabic",
        "tags": [
            "Job Search",
            "Hidden Job Market"
        ]
    },
    {
        "text": "خلينا نحكي بناءً على المرجعية العامة لسوق العمل وهي: الاحترافية\n\nأنا ما بزبط أروح ببدلة رياضة على عرس\n\nوأخوي ما بنفع يروح ببدلة الدوام على رحلة\n\nفهيك إحنا بنتفق إنه لكل مقام مقال.. وهاد كان معروف سابقاً زي بروتوكول\n\nحالياً الموضوع اختلف شوي، وهاد يتطلب وعي من الشركات\n\nلأنه في بعض بيئات العمل ازداد سوء تقدير الموظفين لطبيعة اللبس اللي لازم ينلبس وهاد طبعاً بيأثر على المكان، وكمان على نفسية الموظفين\n\nlook good feel good لأنه\n\nوهون بيجي دور الشركات من باب الاحترافية تحدد dress code للموظفين والموظفات\n\nلأنه إحنا نعمل وفقاً لقوانين بكل شي: وقت الدوام، لغة الإيميلات، طبيعة الاجتماعات، التدخل بحسابات الموظفين على وسائل التواصل.. ما اعتقد وصلنا للصمت عند اللباس -\n\nبتذكر كنت بمدرسة محدد فيه للمعلمات قميص أي لون كم طويل مع تنورة سودا طويلة\n\nوإذا رح نحكي من باب المساواة.. ما في مشكلة ببنطلون وقميص أو بدلة رسمية للكل\n\nأو إذا بدنا نعتمد theme الأعراس والحفلات فكمان ممكن نغش من ال\n\nHenna vibes\n\nوناخد الثوب ونداوم فيه",
        "line_count": 17,
        "language": "Arabic",
        "tags": [
            "Professional Development",
            "Work Attire"
        ]
    },
    {
        "text": "وأنا عم باخد جولتي المعتادة بالمحتوى اللي بنزل هون...\n\nفي نصيحة حابة أوجهها لصناع المحتوى ممكن يستفيدوا منها.. وممكن أكون غلطانة:\n\nتأكد إنه المحتوى اللي بتنشره بناسب السوق اللي أنت عم تخاطبه. كثير من المحتوى العربي اللي بنكتب هون هو مستلهم من محتوى أجنبي وهاد مش غلط أنا بعملها\n\nلكن من 10 حسابات أجنبية بتابعها يومياً يمكن أقدر أخد فكرة وحدة بالأسبوع فقط\n\nوالسبب: المحتوى لا يناسب واقع السوق الأردني اللي أنا مهتمة فيه\n\nيعني لا إحنا دولة بتقدم بدل بطالة\n\nولا إحنا مجتمع معظم النساء فيها مهتمات بالوصول لمناصب قيادية\n\nوعموم الأفراد ما معهم رأس مال يفتحوا شركاتهم الخاصة\n\n! silicon valley وصح: ما عنا\n\nوبعد أحداث السنة الماضية في ناس كتير بطل العمل في جوجل وفيسبوك وأمازون هو طموحها.. حتى في ناس تركت أماكنها بهاي الشركات\n\nمع التأكيد السنوي على إنه إحنا دولة يندر فيها فرص العمل في الأمن السيبراني والذكاء الاصطناعي والروبوتات\n\nهاي المواضيع أنا لما أشوفها بعرف إنه مقتبسة من forbes، business\n\ninsider: Harvard Business review\n\nوهي مصادر قيمة.. لكن ما بزبط ننسخ منها لأنه إحنا مشاكلنا وحلولنا مختلفة جداً",
        "line_count": 18,
        "language": "Arabic",
        "tags": [
            "Content Creation",
            "Job Market",
            "Social Media"
        ]
    },
    {
        "text": "ليش بروح على المقابلة وما برجعوا يرنوا؟\n\nكيف أعطي انطباع رائع عني في المقابلة الأولى؟ ليش فلان بقبلوه وأنا لأ\n\nرغم تقارب المستوى التعليمي والخبرات؟\n\nالسر هون وركز لأنه كثير مهم تركز\n\nبدك تعرف كيف تقدم حالك في أي مكان بتروح عليه\n\nالهوية الشخصية (branding yourself) كثير مهم تتعلم مهارة التعريف عن نفسك باللغتين العربية والإنجليزية.. مش كلام تسميع ولا حفظ جمل.. هي مهارة بتحتاج منك معرفة مسبقة عن نفسك ومواطن القوة في شخصيتك ونقاط الضعف حتى تشتغل على الأولى.. وتحسن الثانية 100%\n\nكيف تحكي؟\n\nمتى تحكي؟\n\nمتى توقف حكي؟\n\nكيف تجاوب؟\n\nال HR بخبرته قادر ياخد عنك انطباع من أول نظرة ويعرف إذا أنت الموظف المناسب أو لا",
        "line_count": 15,
        "language": "Arabic",
        "tags": [
            "Job Interview",
            "Self Improvement",
            "Branding"
        ]
    },
    {
        "text": "مش دايماً الشغل هو اللي بحدد يومك وحياتك\n\nكسر الروتين مش بس بالراحة أو السفر كمان بالأنشطة اللي تعطيك شعور بالإنجاز الحقيقي\n\nt التطوع هو أحد أكثر الأشياء اللي ممكن تكسر الروتين وتخليك تحس إنك بتعمل فرق لما تساعد غيرك مش بس بتغير حياة الناس\n\nکمان بتكتسب تجارب جديدة وتعلمك كيف تكون انسان بحب الحركة ونشر الخير كمان بتساهم بتوسيع علاقاتك لأنها بتفيدك على المدى القريب والبعيد\n\nفكروا في كيف ممكن تخرجوا من دائرة الشغل والضغوط اليومية جربوا تطوعوا ولو لساعة في الأسبوع وأكيد رح تحسوا بالفرق.",
        "line_count": 6,
        "language": "Arabic",
        "tags": [
            "Volunteering",
            "Achievement",
            "Job Search"
        ]
    },
    {
        "text": "في كثير ناس بتحب تنتقد الخريجين الجدد\n\nوتقول ليش مش قادرين يلاقوا شغل ؟\"\n\nأو \"ما عندهم خبرة\"\n\nوبتحط اللوم عليهم...\n\nلما يتخرج الشخص بعد 4 أو 5 سنين دراسة ما بيجي واحد ويعطيه فرصة عمل تلقائياً\n\nسوق العمل مليان تحديات، وبالذات في مجالات بتطلب خبرة وكثير منهم ما لحقوا يكتسبوا هالخبرة بسبب قلة الفرص أو التوجيه الواضح\n\nمثلاً واحد تخرج من الجامعة بتخصص معين وقرر يدخل مجال ثاني لأنه ما لقى فرص كافية في مجاله الأول\n\nهل هو غلطان؟ طبعاً لا\n\nهو بحاول يبني نفسه ويكتسب خبرات جديدة\n\nبنفس الوقت في ضغط اجتماعي كبير\n\nيمكن في ناس قريبة من هذا الخريج عم بتحكي الو أنت لازم تلاقي شغل سريع)\n\nومن هون يبدأ شعور الفشل\n\nاللي لازم نعرفه هو إنه بدل ما ننتقد\n\nلازم نكون جزء من الحل\n\nنوجههم، ندعمهم بالتدريب، نفتح الهم أبواب فرص العمل، ونتفهم التحديات اللي مروا فيها\n\nالخريج هو المستقبل",
        "line_count": 14,
        "language": "Arabic",
        "tags": [
            "Job Opportunities",
            "New Graduates",
            "Training"
        ]
    },
    {
        "text": "الشهادة الجامعية غير مهمة *\n\nالشهادة الجامعية وحدها لا تكفي\n\nمن كان ضد الدراسة الجامعية\n\nليذهب ويرمي شهاداته، ولا يصدعنا بأقوال لا جدوى لها فإذا انت لم تستفيد من شهادتك الجامعية غيرك استفاد\n\nبالرغم من فجوة متطلبات سوق العمل والتعليم الجامعي ما زالت الشهادة الجامعية مفتاح لأول باب السوق العمل\n\nباقي ما تبقى من الأبواب تقع على عاتق المهارات المكتسبة من الدورات والتطوع والخبرات ان وجدت\n\nبالعكس\n\nلا تأخذوا فكرة سلبية عن مخرجات التعليم الجامعي بشكل بحت\n\nيوجد عينات تفوقت على غيرها في أمور كثيرة اثناء الدراسة الجامعية ووصلت لمرحلة متطلبات سوق العمل، من ناحية المهارات الشخصية او التقنية",
        "line_count": 13,
        "language": "Arabic (Jordan dialect)",
        "tags": [
            "Job Market",
            "Education"
        ]
    }
]